# WallLacksCurve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..WallLacksCurve Property
BuiltInFailures..::..WallFailures Class See Also
---
Wall does not have both a curve driver and a curve!!!!
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WallLacksCurve { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallLacksCurve As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WallLacksCurve {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace